quanhengwen/STM32F1xWorkSpace19/Driver/WOW/SCR/STM32_USART - 20190330.C
/******************************** User_library *********************************
* 文件名 	: STM32_SDCard.H
* 作者   	: wegam@sina.com
* 版本   	: V
* 日期   	: 2016/01/01
* 说明   	: 
********************************************************************************
* THE PRESENT FIRMWARE WHICH IS FOR GUIDANCE ONLY AIMS AT PROVIDING CUSTOMERS
* WITH CODING INFORMATION REGARDING THEIR PRODUCTS IN ORDER FOR THEM TO SAVE TIME.
* AS A RESULT, STMICROELECTRONICS SHALL NOT BE HELD LIABLE FOR ANY DIRECT,
* INDIRECT OR CONSEQUENTIAL DAMAGES WITH RESPECT TO ANY CLAIMS ARISING FROM THE
* CONTENT OF SUCH FIRMWARE AND/OR THE USE MADE BY CUSTOMERS OF THE CODING
* INFORMATION CONTAINED HEREIN IN CONNECTION WITH THEIR PRODUCTS.
*******************************************************************************/


#include "STM32_USART.H"

#include "STM32_GPIO.H"
//#include "STM32_SYSTICK.H"
//#include 	"LinkedList.H"

#include "stm32f10x_dma.h"
#include "stm32f10x_gpio.h"
#include "stm32f10x_nvic.h"
#include "stm32f10x_rcc.h"

#include	"stdio.h"			//用于printf
#include	"string.h"		//用于printf
#include	"stdarg.h"		//用于获取不确定个数的参数
#include	"stdlib.h"		//malloc动态申请内存空间


/*##############################################################################
################################################################################
设置波特率时的误差计算
--------------------------------------------------------------------------------
波特率				|fPCLK = 36MHz	误差%			|		fPCLK = 72MHz	误差%			|
--------------------------------------------------------------------------------
2400				|						0%						|						0%							
--------------------------------------------------------------------------------
9600				|						0%						|						0%								
--------------------------------------------------------------------------------
19200				|						0%						|						0%							
--------------------------------------------------------------------------------
57600				|						0%						|						0%							
--------------------------------------------------------------------------------
115200			|						0.15%					|						0%							
--------------------------------------------------------------------------------
230400			|						0.16%					|						0.16%							
--------------------------------------------------------------------------------
460800			|						0.16%					|						0.16%							
--------------------------------------------------------------------------------
921600			|						0.16%					|						0.16%							
--------------------------------------------------------------------------------
2250000			|						0%						|						0%							
--------------------------------------------------------------------------------

################################################################################
###############################################################################*/

//--------USART全局变量定义
#define	uart_dma_buffer_size	256	//默认串口DMA接收缓冲大小,如果配置时未输入缓存大小时使用的默认值
#define	uBaudRate	115200	//默认串口波特率

struct
{
  unsigned short nUSART1;
  unsigned short nUSART2;
  unsigned short nUSART3;
  unsigned short nUART4;
//  unsigned short nUART5;	  //----无DMA
}DmaSize;      //配置时设置的DMA接收缓存大小

/* Private variables ---------------------------------------------------------*/
unsigned char uRx1Addr[uart_dma_buffer_size]={0};
unsigned char uRx2Addr[uart_dma_buffer_size]={0};
unsigned char uRx3Addr[uart_dma_buffer_size]={0};
unsigned char uRx4Addr[uart_dma_buffer_size]={0};

unsigned char uTx1Addr[uart_dma_buffer_size]={0};
unsigned char uTx2Addr[uart_dma_buffer_size]={0};
unsigned char uTx3Addr[uart_dma_buffer_size]={0};
unsigned char uTx4Addr[uart_dma_buffer_size]={0};
/* Private function prototypes -----------------------------------------------*/
//*****************RS485收发控制
void RS485_TX_EN(RS485Def *pRS485);	  //发使能
void RS485_RX_EN(RS485Def *pRS485);		//收使能，已经设置为接收状态返回1，否则返回0

unsigned char* Get_Rxd_Addr(USART_TypeDef* USARTx);
unsigned char* Get_Txd_Addr(USART_TypeDef* USARTx);
unsigned short Set_Dma_InfoSize(USART_TypeDef* USARTx,unsigned short size);
unsigned short Get_Dma_InfoSize(USART_TypeDef* USARTx);
DMA_Channel_TypeDef* Get_Usart_Tx_DMA_Channel(USART_TypeDef* USARTx);
DMA_Channel_TypeDef* Get_Usart_Rx_DMA_Channel(USART_TypeDef* USARTx);
void ClearFlag_Usart_Tx_DMA_Channel(USART_TypeDef* USARTx);
void ClearFlag_Usart_Rx_DMA_Channel(USART_TypeDef* USARTx);
unsigned short Usart_Dma_Send(USART_TypeDef* USARTx,u8 *tx_buffer,u16 BufferSize);		//串口DMA发送程序，如果数据已经传入到DMA，返回Buffer大小，否则返回0
void	Usart_Dma_Initialize	(USART_TypeDef* USARTx,u16 BufferSize);	//串口DMA配置---不开中断，查询方式
void	USART_GPIO_Initialize(USART_TypeDef* USARTx);                 	//串口GPIO配置
//static unsigned char Get_Txd_Status(USART_TypeDef* USARTx);		//获取串口发送状态
//static unsigned char Get_Rxd_Status(USART_TypeDef* USARTx);		//获取串口接收状态

/* function-------------------------------------------------------------------*/
/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
unsigned char* Get_Rxd_Addr(USART_TypeDef* USARTx)
{
	if(USART1	==	USARTx)
	{
		return uRx1Addr;
	}
	else if(USART2	==	USARTx)
	{
		return uRx2Addr;
	}
	else if(USART3	==	USARTx)
	{
		return uRx3Addr;
	}
	else if(UART4	==	USARTx)
	{
		return uRx4Addr;		
	}
	return 0;
}
/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
unsigned char* Get_Txd_Addr(USART_TypeDef* USARTx)
{
	if(USART1	==	USARTx)
	{
		return uTx1Addr;
	}
	else if(USART2	==	USARTx)
	{
		return uTx2Addr;
	}
	else if(USART3	==	USARTx)
	{
		return uTx3Addr;
	}
	else if(UART4	==	USARTx)
	{
		return uTx4Addr;		
	}
	return 0;
}
/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
unsigned short Set_Dma_InfoSize(USART_TypeDef* USARTx,unsigned short size)
{
	if(0==size)	//如果未设定缓存大小，使用默认值
		size	=	uart_dma_buffer_size;
	if(USART1	==	USARTx)
	{
		if(size>uart_dma_buffer_size)
			DmaSize.nUSART1	=	uart_dma_buffer_size;
		else
			DmaSize.nUSART1	=	size;
		return DmaSize.nUSART1;
	}
	else if(USART2	==	USARTx)
	{
		if(size>uart_dma_buffer_size)
			DmaSize.nUSART2	=	uart_dma_buffer_size;
		else
			DmaSize.nUSART2	=	size;
		return DmaSize.nUSART2;
	}
	else if(USART3	==	USARTx)
	{
		if(size>uart_dma_buffer_size)
			DmaSize.nUSART3	=	uart_dma_buffer_size;
		else
			DmaSize.nUSART3	=	size;
		return DmaSize.nUSART3;
	}
	else if(UART4	==	USARTx)
	{
		if(size>uart_dma_buffer_size)
			DmaSize.nUART4	=	uart_dma_buffer_size;
		else
			DmaSize.nUART4	=	size;
		return DmaSize.nUART4;
	}
	return 0;
}
/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
unsigned short Get_Dma_InfoSize(USART_TypeDef* USARTx)
{
	if(USART1	==	USARTx)
	{
		return DmaSize.nUSART1;
	}
	else if(USART2	==	USARTx)
	{
		return DmaSize.nUSART2;
	}
	else if(USART3	==	USARTx)
	{
		return DmaSize.nUSART3;
	}
	else if(UART4	==	USARTx)
	{
		return DmaSize.nUART4;
	}
	return 0;
}
/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
DMA_Channel_TypeDef* Get_Usart_Tx_DMA_Channel(USART_TypeDef* USARTx)
{
	if(USART1	==	USARTx)
	{
		return DMA1_Channel4;
	}
	else if(USART2	==	USARTx)
	{
		return DMA1_Channel7;
	}
	else if(USART3	==	USARTx)
	{
		return DMA1_Channel2;
	}
	else if(UART4	==	USARTx)
	{
		return DMA2_Channel5;
	}
	return 0;	
}
/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
DMA_Channel_TypeDef* Get_Usart_Rx_DMA_Channel(USART_TypeDef* USARTx)
{
	if(USART1	==	USARTx)
	{
		return DMA1_Channel5;
	}
	else if(USART2	==	USARTx)
	{
		return DMA1_Channel6;
	}
	else if(USART3	==	USARTx)
	{
		return DMA1_Channel3;
	}
	else if(UART4	==	USARTx)
	{
		return DMA2_Channel3;
	}
	return 0;	
}
/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
void ClearFlag_Usart_Tx_DMA_Channel(USART_TypeDef* USARTx)
{
	if(USART1	==	USARTx)
	{
		DMA_ClearFlag(DMA1_FLAG_GL4);                                 					// 清除DMA所有标志
	}
	else if(USART2	==	USARTx)
	{
		DMA_ClearFlag(DMA1_FLAG_GL7);                                 					// 清除DMA所有标志
	}
	else if(USART3	==	USARTx)
	{
		DMA_ClearFlag(DMA1_FLAG_GL2);                                 					// 清除DMA所有标志
	}
	else if(UART4	==	USARTx)
	{
		DMA_ClearFlag(DMA2_FLAG_GL5);                                 					// 清除DMA所有标志
	}
}
/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
void ClearFlag_Usart_Rx_DMA_Channel(USART_TypeDef* USARTx)
{
	if(USART1	==	USARTx)
	{
		DMA_ClearFlag(DMA1_FLAG_GL5);                                 					// 清除DMA所有标志
	}
	else if(USART2	==	USARTx)
	{
		DMA_ClearFlag(DMA1_FLAG_GL6);                                 					// 清除DMA所有标志
	}
	else if(USART3	==	USARTx)
	{
		DMA_ClearFlag(DMA1_FLAG_GL3);                                 					// 清除DMA所有标志
	}
	else if(UART4	==	USARTx)
	{
		DMA_ClearFlag(DMA2_FLAG_GL3);                                 					// 清除DMA所有标志
	}
}
/*******************************************************************************
*函数名			:	USART_DMA_ConfigurationNr
*功能描述		:	USART_DMA配置--查询方式，不开中断
*输入				: 
*返回值			:	无
*******************************************************************************/
void	Usart_Dma_Initialize(USART_TypeDef* USARTx,u16 BufferSize)	//USART_DMA配置--查询方式，不开中断
{
	//1)**********定义变量	
	DMA_InitTypeDef DMA_Initstructure;
	
	unsigned char*	uart_rxd	=	Get_Rxd_Addr(USARTx);
	unsigned short dma_size	=	Set_Dma_InfoSize(USARTx,BufferSize);
	
